SBachman/BLTouch-Taz-5/ArduinoAddons/arduino-1.8.5/packages/ultimachine/hardware/sam/1.6.9-b/boards.txt
archim.name=Archim
archim.upload.tool=bossac
archim.upload.protocol=sam-ba
archim.upload.maximum_size=524288
archim.upload.use_1200bps_touch=true
archim.upload.wait_for_upload_port=true
archim.upload.native_usb=true
archim.build.mcu=cortex-m3
archim.build.f_cpu=84000000L
archim.build.usb_product="Archim"
archim.build.usb_manufacturer="UltiMachine"
archim.build.board=SAM_ARCHIM
archim.build.core=arduino
archim.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
archim.build.ldscript=linker_scripts/gcc/flash.ld
archim.build.variant=archim
archim.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
archim.build.vid=0x27b1
archim.build.pid=0x0001